Revit 2027 API
RuledSurface.GetFirstProfileCurve Method
 Returns a copy of the first profile curve if it is set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve GetFirstProfileCurve()
Public Function GetFirstProfileCurve As Curve
public:
Curve^ GetFirstProfileCurve()
member GetFirstProfileCurve : unit -> Curve
Return Value
Curve
 A copy of the first profile curve, if it exists. If a point was used to define the first profile, this function will return null.
See Also
Reference
RuledSurface Class
Autodesk.Revit.DB Namespace